Revit 2024 API
AllowLargeGeometry Enumeration
 An enumerated type containing settings information related to handling of large geometries.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Since: 2020
Syntax
C#
public enum AllowLargeGeometry
Visual Basic
Public Enumeration AllowLargeGeometry
Visual C++
public enum class AllowLargeGeometry
Members
Member name | Description
DisAllow |  Cancel the export/path of travel creation, failing with the apporiate status.
Allow |  Allow export/path of travel creation on large geometries.
Prompt |  Prompt in the UI. If no UI is present, default will be DisAllow.
See Also
Autodesk.Revit.DB.Analysis Namespace